code-review/NRB_3471_3546/База_Стало/Catalogs/ВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыОпераций</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КлассОпераций</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КлассыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АнглийскоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДвижениеПоЦБ</Name>
					<Comment>Включает движения по регистрам ОстаткиЦБДепозитарийМХ и ОстаткиЦБМестоРасчетов</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыплатаДоходаВДенежнойФорме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомплектДокументов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОперацииИФИ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКорпоративныхДействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Catalogs/ВидыОпераций/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция ВидОперацииИзменениеАнкетныхДанных() Экспорт
	
	ОперацияИзменениеАнкетныхДанныхСсылка = НайтиПоНаименованию("Изменение анкетных данных");
	Если Не ЗначениеЗаполнено(ОперацияИзменениеАнкетныхДанныхСсылка) Тогда
		УстановитьПривилегированныйРежим(Истина);
		ОперацияИзменениеАнкетныхДанных = Справочники.ВидыОпераций.СоздатьЭлемент();
		ОперацияИзменениеАнкетныхДанных.Наименование = "Изменение анкетных данных";
		ОперацияИзменениеАнкетныхДанных.КлассОпераций = Перечисления.КлассыОпераций.Административные;
		ОперацияИзменениеАнкетныхДанных.Записать();
		ОперацияИзменениеАнкетныхДанныхСсылка = ОперацияИзменениеАнкетныхДанных.Ссылка;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ОперацияИзменениеАнкетныхДанныхСсылка;
КонецФункции

Функция ОперацииВыплатыДоходаВДенежнойФорме() Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВидыОпераций.Ссылка КАК ВидОперации
	|ИЗ
	|	Справочник.ВидыОпераций КАК ВидыОпераций
	|ГДЕ
	|	ВидыОпераций.ВыплатаДоходаВДенежнойФорме");
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидОперации");
КонецФункции

// Определяет, является ли переданный вид операции, выплатой дохода по акциям или иным ценным бумагам
//
// Параметры:
//  ВидОперации	 - СправочникСсылка.ВидыОпераций - вид операции
// 
// Возвращаемое значение:
//  Булево - признак того, что переданный вид операции является выплатой дохода по акциям или иным ценным бумагам
//
Функция ЭтоВыплатаДоходаПоАкциямИлиИнымЦБ(ВидОперации) Экспорт
	
	Возврат ВидОперации = НачислениеДивидендов Или ВидОперации = НачислениеДоходаПрочие Или ВидОперации = ПогашениеНКД;
	
КонецФункции

// Определяет, является ли переданный вид операции, переводом ЦБ
//
// Параметры:
//  ВидОперации	 - СправочникСсылка.ВидыОпераций - вид операции
// 
// Возвращаемое значение:
//  Булево - признак того, что переданный вид операции является переводом
//
Функция ЭтоПереводЦБ(ВидОперации) Экспорт
	
	Возврат ВидОперации = Перевод Или ВидОперации = ПереводМеждуРазделамиСчетаДепо Или ВидОперации = Перемещение;
	
КонецФункции

#КонецОбласти
